# Dados Absolutos e Relativos

## Percentuais

In [1]:
# Bibliotecas
import pandas as pd

In [2]:
dados = {
    'emprego': [
        'Administrador_banco_dados',
        'Programador',
        'Arquiteto_redes'
    ],
    'nova_jersey': [
        97350,
        82080,
        112840
    ],
    'florida': [
        77140,
        71540,
        62310
    ]
}

dados

{'emprego': ['Administrador_banco_dados', 'Programador', 'Arquiteto_redes'],
 'nova_jersey': [97350, 82080, 112840],
 'florida': [77140, 71540, 62310]}

In [3]:
# Criando um dataset com os dados
ds = pd.DataFrame(dados)
ds

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2            Arquiteto_redes       112840    62310

In [4]:
# Visualizando o total
ds['nova_jersey'].sum(), ds['florida'].sum()

(292270, 210990)

In [5]:
# Criando a coluna de percentual nova_jersey
ds['%_nova_jersey'] = (ds['nova_jersey'] / ds['nova_jersey'].sum()) * 100
ds

                     emprego  nova_jersey  florida  %_nova_jersey
0  Administrador_banco_dados        97350    77140      33.308242
1                Programador        82080    71540      28.083621
2            Arquiteto_redes       112840    62310      38.608136

In [6]:
# Criando a coluna de percentual florida
ds['%_florida'] = (ds['florida'] / ds['florida'].sum()) * 100
ds

                     emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Administrador_banco_dados        97350    77140      33.308242  36.560974
1                Programador        82080    71540      28.083621  33.906820
2            Arquiteto_redes       112840    62310      38.608136  29.532205